#! /usr/bin/python
# -*- coding: utf-8 -*-
"""Конвертер из HIP в UCS-8. 

"""
 
class Repl:
    def __init__(self):
        self.repl_lst = [('*ё', u'jj\u044c'), 
                        ('*й', u'_i'), 
                        ('_*о', u'_w'), 
                        ('_и', u'v"'), 
                        ("_и'", u"v'"), 
                        ('ё', u'j\u044c'), 
                        ('э', u'_\u0435'), 
                        ('*о', u'w'), 
                        ('*и', u'i'), 
                        ('*е', u'j\u0435'), 
                        ('*я', u'j\u044f'), 
                        ('*ю', u'ju'), 
                        ('_я', u'j\u0430'), 
                        ('_з', u's'), 
                        ('_ф', u'f'), 
                        ('_ю', u'u'), 
                        ('_в', u'v'), 
                        ('*е', u'<\u0435>'), 
                        ('_е', u'<\u0435>'), 
                        ('T', u'W\\\u0442'), 
                        ('Q', u'_W'), 
                        ('*О', u'W'), 
                        ('_Е', u'\u0415'), 
                        ('_З', u'S'), 
                        ('_И', u'V"'), 
                        ("_И'", u"V'"), 
                        ('_В', u'V'), 
                        ('*Я', u'U'), 
                        ('_Ф', u'F'), 
                        ('_Я', u'J\u0420'), 
                        ('_Ю', u'Ju'), 
                        ('*Я', u'J\u044f'), 
                        ('*Е', u'Je'), 
                        ('*Ё', u'JJ\u044c'), 
                        ('*Й', u'_I'), 
                        ('*И', u'I'), 
                        ('Э', u'_\u0415'), 
                        ('Ё', u'J\u044c'), 

                        # ударения и придыхания
                        ("='", u'4'), 
                        ('=`', u'5'), 
                        ("'", u'1'), 
                        ('`', u'2'), 
                        ('=', u'3'), 
                        ('^', u'6'), 
                        ('~', u'7'),
                         # Заглавные буквы с надрстроч
                        ('Jа', u'J\u0410'), # приведение к универсальному
                                            # виду
                        ('JА4', u'\u040b'), 
                        ('JА3', u'\u004b'), 
                        ('JА1', u'\u042f\u007e'), 

                        ("А4", u'\u0403'), 
#                        ('А5`', u'J\u044c'), 
                        ('А1', u'\u0410\u007e'), 
                        ('А2', u'\u0410\u0040'), 
                        ('А3', u'\u0490'), 

                        ('Е4', u'\u0415\u0024'), 
                        ('Е3', u'\u0415\u0023'), 
                        ('Е1', u'\u0415\u007e'), 
                        ('Е2', u'\u0415\u0040'), 

                        ('И4', u'\u0418\u0024'), 
                        ('И3', u'\u0418\u0023'), 
                        ('И1', u'\u0418\u007e'), 
                        ('И2', u'\u0418\u0040'), 

                        ('I4', u'\u0408'), 
                        ('I3', u'\u0407'), 
                        ('I1', u'\u0407\u007e'), 

                        ('_О4', u'\u040f'),    # _О
                        ('_О3', u'\u004e'),    # _О
                        ('_О', u'\u004f'),    # _О
                        ('О4', u'\u041e\u0024'), 
                        ('О3', u'\u041e\u0023'), 
                        ('О1', u'\u041e\u007e'), 
                        ('О2', u'\u041e\u0040'), 

                        ('_W4', u'\u0051'), 
                        ('_W', u'\u0051'), 
                        ('_w4', u'\u0071'), 
                        ('_w', u'\u0071'), 

                        ('W\т', u'\u0054'), 

                        ('W4', u'\u0057\u0024'), 
                        ('W3', u'\u040a'), 
                        ('W1', u'\u0057\u007e'), 
                        ('W2', u'\u0057\u0040'), 

                        ('О_у4', u'\u040c'),    # О_у с надстроч 
                        ('О_у3', u'\u040e'), 

#                        ('У', u'\u044c'), 
#                        ('У', u'\u044c'), 
#
                        ('Ю4', u'\u042e\u0024'), 
                        ('Ю3', u'\u042e\u0023'), 
                        ('Ю1', u'\u042e\u007e'), 
                        ('Ю2', u'\u042e\u0040'), 


                        ('Я4', u'\u005a'), 
                        ('Я3', u'\u0409'), 
                        ('Я1', u'\u005a\u007e'), 
                        ('Я2', u'\u005a\u0040'), 

                       # букво-титла
                        ('\\ъ', u'8'),
                        ('\\в', u'\u002b'),
                        ('\\х', u'\u003c'),
                        ('\\н', u'\u003d'),
                        ('\\р', u'\u003e'),
                        ('\\ч', u'\u003f'),
                        ('\\о', u'\u0062'),
                        ('\\с', u'\u0063'),
                        ('\\д', u'\u0064'),
                        ('\\г', u'\u0067'),
                        ('\\з', u'\u20ac'),
                        ('w\\т', u'\u0074'),
#                        ('jа', u'\u044f'),
                        ('jа', u'zz'),

                        # маскируем дифтонги, сочетания с i
#                        ('о_у4', u'\u045c'),              # о_у
#                        ('о_у3', u'\u045e'),              # о_у
                        ('о_у', u'u'),              # о_у
                        ('_у', u'\u00b5'),          # ук 
                        ('а4', u'\u0453'),          # аз
                        ('а1', u'\u0061'),
                        ('а2', u'\u0041'),
                        ('а3', u'\u0491'),
                        ('а6', u'\u2020'),
                        ('а7', u'\u2116'),

                        ('е1', u'\u0065'),
                        ('е2', u'\u0045'),

                        ('я5', u'\u007c'),          # юс малый 
#                        ('я1', u'\u0073'),    # показывает s вместо юникода. PyGTK?
                        ('я1', u'kk'),    # показывает s вместо юникода. PyGTK?
                        ('я2', u'\u0053'), 
                        ('я3', u'\u0459'), 
                        ('я6', u'\u2030'), 
                        ('я', u'\u007a'), 
                        ('zz', u'\u044f'),
                        ('i4', u'r4'), 
                        ('i5', u'r5'), 
                        ('i3', u'r3'), 
                        ('i1', u'r1'), 
                        ('i2', u'r2'), 
                        ('_i', u'_r'), 
                        ('_кс', u'x'),   # кси
                        ('_пс', u'p'),   # пси
                        ('_Кс', u'\u0058'),   # кси
                        ('_Пс', u'\u0050'),   # пси
#                        # basic conversion                        
                        ('s', u'\u0455'),
                        ('kk', u'\u0073'),   #  подстановка для я1 
                        ("jь1", u'\u0451'),    # ять
                        ('jь2', u'\u0401'),
                        ('jь6', u'\u044d^'),
                        ('jь', u'\u044d'),
                        ("у1", u'\u0079'),    # у лигатурное с ударением
                        ("у2", u'\u0059'),
                        ("у6", u'\u007b'),     
                        ('<е>', u'\u0454'),   # вытянутое е
                        ('_w', u'\u045a'),
                        ('_о', u'\u006f'),    # _о
                        ('_r', u'\u2039'),         # i~
                        ('v"', u'm'),
                        ('r4', u'\u0458'),         # i='
                        ('r3', u'\u0457'),         # i=
                        ('r1', u'j'),
                        ('r2', u'J'),
                        ('i', u'\u0456'),          # i с двумя точками (default)
                        ('u3', u'\u045e'),         # о_у=
                        ('u4', u'\u045c'),         # о_у='
                        # red letters switched off
#                        ('%<', u''),
#                       ('%>', u'')]
                         # конвертируем киноварь в "костыльные" метки
                        ('%<', u'\1'),
                        ('%>', u'\2')]
                       
    def __call__(self, S):
        # создаем список кортежей по 2 эл. из двух строк
        # текст на входе д.б уже конвертирован в utf8!
        self.S = S
        for i in self.repl_lst:
#            sear = i[0].encode('utf8')
            repl = i[1].encode('utf8')
            self.S = self.S.replace(i[0], repl) 
 
        return self.S

if __name__ == "__main__":
    txt = 'проба пjьра о_у=бw'
    conv = Repl()
    print conv(txt)
